#ifndef RUUL_H
#define RUUL_H

#include <R.h>

/* --------------------------------------------------------------------------*/
/**
 * @Synopsis  标准矩阵的创建
 *
 * @Param  X 输入的数据矩阵
 * @Param  OPT 标准矩阵创建的方法
 *
 * @Returns  创建的标准矩阵
 */
/* --------------------------------------------------------------------------*/
extern SEXP Ruul__scale (SEXP X, SEXP OPT);

/* --------------------------------------------------------------------------*/
/**
 * @Synopsis  相似矩阵的创建
 *
 * @Param  X 输入的数据矩阵
 * @Param  OPT 相似矩阵创建的方法
 *
 * @Returns  创建的相似矩阵
 */
/* --------------------------------------------------------------------------*/
extern SEXP Ruul__dist (SEXP X, SEXP OPT);

/* --------------------------------------------------------------------------*/
/**
 * @Synopsis  关系矩阵的合成
 *
 * @Param  R1 输入的关系矩阵R1
 * @Param  R2 输入的关系矩阵R2
 *
 * @Returns  合成的关系矩阵
 */
/* --------------------------------------------------------------------------*/
extern SEXP Ruul__bind (SEXP R1, SEXP R2);

#endif /* Ruul.h */

